frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/acifc.h
#define ACIFC_SR_ACCS0_Pos          0            /**< \brief (ACIFC_SR) AC0 Current Comparison Status */
#define ACIFC_SR_ACCS0              (_U(0x1) << ACIFC_SR_ACCS0_Pos)
#define ACIFC_SR_ACRDY0_Pos         1            /**< \brief (ACIFC_SR) AC0 Ready */
#define ACIFC_SR_ACRDY0             (_U(0x1) << ACIFC_SR_ACRDY0_Pos)
#define ACIFC_SR_ACCS1_Pos          2            /**< \brief (ACIFC_SR) AC1 Current Comparison Status */
#define ACIFC_SR_ACCS1              (_U(0x1) << ACIFC_SR_ACCS1_Pos)
#define ACIFC_SR_ACRDY1_Pos         3            /**< \brief (ACIFC_SR) AC1 Ready */
#define ACIFC_SR_ACRDY1             (_U(0x1) << ACIFC_SR_ACRDY1_Pos)
#define ACIFC_SR_ACCS2_Pos          4            /**< \brief (ACIFC_SR) AC2 Current Comparison Status */
#define ACIFC_SR_ACCS2              (_U(0x1) << ACIFC_SR_ACCS2_Pos)
#define ACIFC_SR_ACRDY2_Pos         5            /**< \brief (ACIFC_SR) AC2 Ready */
#define ACIFC_SR_ACRDY2             (_U(0x1) << ACIFC_SR_ACRDY2_Pos)
#define ACIFC_SR_ACCS3_Pos          6            /**< \brief (ACIFC_SR) AC3 Current Comparison Status */
#define ACIFC_SR_ACCS3              (_U(0x1) << ACIFC_SR_ACCS3_Pos)
#define ACIFC_SR_ACRDY3_Pos         7            /**< \brief (ACIFC_SR) AC3 Ready */
#define ACIFC_SR_ACRDY3             (_U(0x1) << ACIFC_SR_ACRDY3_Pos)
#define ACIFC_SR_ACCS4_Pos          8            /**< \brief (ACIFC_SR) AC4 Current Comparison Status */
#define ACIFC_SR_ACCS4              (_U(0x1) << ACIFC_SR_ACCS4_Pos)
#define ACIFC_SR_ACRDY4_Pos         9            /**< \brief (ACIFC_SR) AC4 Ready */
#define ACIFC_SR_ACRDY4             (_U(0x1) << ACIFC_SR_ACRDY4_Pos)
#define ACIFC_SR_ACCS5_Pos          10           /**< \brief (ACIFC_SR) AC5 Current Comparison Status */
#define ACIFC_SR_ACCS5              (_U(0x1) << ACIFC_SR_ACCS5_Pos)
#define ACIFC_SR_ACRDY5_Pos         11           /**< \brief (ACIFC_SR) AC5 Ready */
#define ACIFC_SR_ACRDY5             (_U(0x1) << ACIFC_SR_ACRDY5_Pos)
#define ACIFC_SR_ACCS6_Pos          12           /**< \brief (ACIFC_SR) AC6 Current Comparison Status */
#define ACIFC_SR_ACCS6              (_U(0x1) << ACIFC_SR_ACCS6_Pos)
#define ACIFC_SR_ACRDY6_Pos         13           /**< \brief (ACIFC_SR) AC6 Ready */
#define ACIFC_SR_ACRDY6             (_U(0x1) << ACIFC_SR_ACRDY6_Pos)
#define ACIFC_SR_ACCS7_Pos          14           /**< \brief (ACIFC_SR) AC7 Current Comparison Status */
#define ACIFC_SR_ACCS7              (_U(0x1) << ACIFC_SR_ACCS7_Pos)
#define ACIFC_SR_ACRDY7_Pos         15           /**< \brief (ACIFC_SR) AC7 Ready */
#define ACIFC_SR_ACRDY7             (_U(0x1) << ACIFC_SR_ACRDY7_Pos)
#define ACIFC_SR_WFCS0_Pos          24           /**< \brief (ACIFC_SR) Window0 Mode Current Status */
#define ACIFC_SR_WFCS0              (_U(0x1) << ACIFC_SR_WFCS0_Pos)
#define ACIFC_SR_WFCS1_Pos          25           /**< \brief (ACIFC_SR) Window1 Mode Current Status */
#define ACIFC_SR_WFCS1              (_U(0x1) << ACIFC_SR_WFCS1_Pos)
#define ACIFC_SR_WFCS2_Pos          26           /**< \brief (ACIFC_SR) Window2 Mode Current Status */
#define ACIFC_SR_WFCS2              (_U(0x1) << ACIFC_SR_WFCS2_Pos)
#define ACIFC_SR_WFCS3_Pos          27           /**< \brief (ACIFC_SR) Window3 Mode Current Status */
#define ACIFC_SR_WFCS3              (_U(0x1) << ACIFC_SR_WFCS3_Pos)
#define ACIFC_SR_MASK               _U(0x0F00FFFF) /**< \brief (ACIFC_SR) MASK Register */

/* -------- ACIFC_IER : (ACIFC Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACINT0:1;         /*!< bit:      0  AC0 Interrupt Enable               */
    uint32_t SUTINT0:1;        /*!< bit:      1  AC0 Startup Time Interrupt Enable  */
    uint32_t ACINT1:1;         /*!< bit:      2  AC1 Interrupt Enable               */
    uint32_t SUTINT1:1;        /*!< bit:      3  AC1 Startup Time Interrupt Enable  */
    uint32_t ACINT2:1;         /*!< bit:      4  AC2 Interrupt Enable               */
    uint32_t SUTINT2:1;        /*!< bit:      5  AC2 Startup Time Interrupt Enable  */
    uint32_t ACINT3:1;         /*!< bit:      6  AC3 Interrupt Enable               */
    uint32_t SUTINT3:1;        /*!< bit:      7  AC3 Startup Time Interrupt Enable  */
    uint32_t ACINT4:1;         /*!< bit:      8  AC4 Interrupt Enable               */
    uint32_t SUTINT4:1;        /*!< bit:      9  AC4 Startup Time Interrupt Enable  */
    uint32_t ACINT5:1;         /*!< bit:     10  AC5 Interrupt Enable               */
    uint32_t SUTINT5:1;        /*!< bit:     11  AC5 Startup Time Interrupt Enable  */
    uint32_t ACINT6:1;         /*!< bit:     12  AC6 Interrupt Enable               */
    uint32_t SUTINT6:1;        /*!< bit:     13  AC6 Startup Time Interrupt Enable  */
    uint32_t ACINT7:1;         /*!< bit:     14  AC7 Interrupt Enable               */
    uint32_t SUTINT7:1;        /*!< bit:     15  AC7 Startup Time Interrupt Enable  */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t WFINT0:1;         /*!< bit:     24  Window0 Mode Interrupt Enable      */
    uint32_t WFINT1:1;         /*!< bit:     25  Window1 Mode Interrupt Enable      */
    uint32_t WFINT2:1;         /*!< bit:     26  Window2 Mode Interrupt Enable      */
    uint32_t WFINT3:1;         /*!< bit:     27  Window3 Mode Interrupt Enable      */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_IER_OFFSET            0x10         /**< \brief (ACIFC_IER offset) Interrupt Enable Register */
#define ACIFC_IER_RESETVALUE        _U(0x00000000); /**< \brief (ACIFC_IER reset_value) Interrupt Enable Register */

#define ACIFC_IER_ACINT0_Pos        0            /**< \brief (ACIFC_IER) AC0 Interrupt Enable */
#define ACIFC_IER_ACINT0            (_U(0x1) << ACIFC_IER_ACINT0_Pos)
#define ACIFC_IER_SUTINT0_Pos       1            /**< \brief (ACIFC_IER) AC0 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT0           (_U(0x1) << ACIFC_IER_SUTINT0_Pos)
#define ACIFC_IER_ACINT1_Pos        2            /**< \brief (ACIFC_IER) AC1 Interrupt Enable */
#define ACIFC_IER_ACINT1            (_U(0x1) << ACIFC_IER_ACINT1_Pos)
#define ACIFC_IER_SUTINT1_Pos       3            /**< \brief (ACIFC_IER) AC1 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT1           (_U(0x1) << ACIFC_IER_SUTINT1_Pos)
#define ACIFC_IER_ACINT2_Pos        4            /**< \brief (ACIFC_IER) AC2 Interrupt Enable */
#define ACIFC_IER_ACINT2            (_U(0x1) << ACIFC_IER_ACINT2_Pos)
#define ACIFC_IER_SUTINT2_Pos       5            /**< \brief (ACIFC_IER) AC2 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT2           (_U(0x1) << ACIFC_IER_SUTINT2_Pos)
#define ACIFC_IER_ACINT3_Pos        6            /**< \brief (ACIFC_IER) AC3 Interrupt Enable */
#define ACIFC_IER_ACINT3            (_U(0x1) << ACIFC_IER_ACINT3_Pos)
#define ACIFC_IER_SUTINT3_Pos       7            /**< \brief (ACIFC_IER) AC3 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT3           (_U(0x1) << ACIFC_IER_SUTINT3_Pos)
#define ACIFC_IER_ACINT4_Pos        8            /**< \brief (ACIFC_IER) AC4 Interrupt Enable */
#define ACIFC_IER_ACINT4            (_U(0x1) << ACIFC_IER_ACINT4_Pos)
#define ACIFC_IER_SUTINT4_Pos       9            /**< \brief (ACIFC_IER) AC4 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT4           (_U(0x1) << ACIFC_IER_SUTINT4_Pos)
#define ACIFC_IER_ACINT5_Pos        10           /**< \brief (ACIFC_IER) AC5 Interrupt Enable */
#define ACIFC_IER_ACINT5            (_U(0x1) << ACIFC_IER_ACINT5_Pos)
#define ACIFC_IER_SUTINT5_Pos       11           /**< \brief (ACIFC_IER) AC5 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT5           (_U(0x1) << ACIFC_IER_SUTINT5_Pos)
#define ACIFC_IER_ACINT6_Pos        12           /**< \brief (ACIFC_IER) AC6 Interrupt Enable */
#define ACIFC_IER_ACINT6            (_U(0x1) << ACIFC_IER_ACINT6_Pos)
#define ACIFC_IER_SUTINT6_Pos       13           /**< \brief (ACIFC_IER) AC6 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT6           (_U(0x1) << ACIFC_IER_SUTINT6_Pos)
#define ACIFC_IER_ACINT7_Pos        14           /**< \brief (ACIFC_IER) AC7 Interrupt Enable */
#define ACIFC_IER_ACINT7            (_U(0x1) << ACIFC_IER_ACINT7_Pos)
#define ACIFC_IER_SUTINT7_Pos       15           /**< \brief (ACIFC_IER) AC7 Startup Time Interrupt Enable */
#define ACIFC_IER_SUTINT7           (_U(0x1) << ACIFC_IER_SUTINT7_Pos)
#define ACIFC_IER_WFINT0_Pos        24           /**< \brief (ACIFC_IER) Window0 Mode Interrupt Enable */
#define ACIFC_IER_WFINT0            (_U(0x1) << ACIFC_IER_WFINT0_Pos)
#define ACIFC_IER_WFINT1_Pos        25           /**< \brief (ACIFC_IER) Window1 Mode Interrupt Enable */
#define ACIFC_IER_WFINT1            (_U(0x1) << ACIFC_IER_WFINT1_Pos)
#define ACIFC_IER_WFINT2_Pos        26           /**< \brief (ACIFC_IER) Window2 Mode Interrupt Enable */
#define ACIFC_IER_WFINT2            (_U(0x1) << ACIFC_IER_WFINT2_Pos)
#define ACIFC_IER_WFINT3_Pos        27           /**< \brief (ACIFC_IER) Window3 Mode Interrupt Enable */
#define ACIFC_IER_WFINT3            (_U(0x1) << ACIFC_IER_WFINT3_Pos)
#define ACIFC_IER_MASK              _U(0x0F00FFFF) /**< \brief (ACIFC_IER) MASK Register */

/* -------- ACIFC_IDR : (ACIFC Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACINT0:1;         /*!< bit:      0  AC0 Interrupt Disable              */
    uint32_t SUTINT0:1;        /*!< bit:      1  AC0 Startup Time Interrupt Disable */
    uint32_t ACINT1:1;         /*!< bit:      2  AC1 Interrupt Disable              */
    uint32_t SUTINT1:1;        /*!< bit:      3  AC1 Startup Time Interrupt Disable */
    uint32_t ACINT2:1;         /*!< bit:      4  AC2 Interrupt Disable              */
    uint32_t SUTINT2:1;        /*!< bit:      5  AC2 Startup Time Interrupt Disable */
    uint32_t ACINT3:1;         /*!< bit:      6  AC3 Interrupt Disable              */
    uint32_t SUTINT3:1;        /*!< bit:      7  AC3 Startup Time Interrupt Disable */
    uint32_t ACINT4:1;         /*!< bit:      8  AC4 Interrupt Disable              */
    uint32_t SUTINT4:1;        /*!< bit:      9  AC4 Startup Time Interrupt Disable */
    uint32_t ACINT5:1;         /*!< bit:     10  AC5 Interrupt Disable              */
    uint32_t SUTINT5:1;        /*!< bit:     11  AC5 Startup Time Interrupt Disable */
    uint32_t ACINT6:1;         /*!< bit:     12  AC6 Interrupt Disable              */
    uint32_t SUTINT6:1;        /*!< bit:     13  AC6 Startup Time Interrupt Disable */
    uint32_t ACINT7:1;         /*!< bit:     14  AC7 Interrupt Disable              */
    uint32_t SUTINT7:1;        /*!< bit:     15  AC7 Startup Time Interrupt Disable */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t WFINT0:1;         /*!< bit:     24  Window0 Mode Interrupt Disable     */
    uint32_t WFINT1:1;         /*!< bit:     25  Window1 Mode Interrupt Disable     */
    uint32_t WFINT2:1;         /*!< bit:     26  Window2 Mode Interrupt Disable     */
    uint32_t WFINT3:1;         /*!< bit:     27  Window3 Mode Interrupt Disable     */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_IDR_OFFSET            0x14         /**< \brief (ACIFC_IDR offset) Interrupt Disable Register */
#define ACIFC_IDR_RESETVALUE        _U(0x00000000); /**< \brief (ACIFC_IDR reset_value) Interrupt Disable Register */

