frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/acifc.h
#define ACIFC_IDR_ACINT0_Pos        0            /**< \brief (ACIFC_IDR) AC0 Interrupt Disable */
#define ACIFC_IDR_ACINT0            (_U(0x1) << ACIFC_IDR_ACINT0_Pos)
#define ACIFC_IDR_SUTINT0_Pos       1            /**< \brief (ACIFC_IDR) AC0 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT0           (_U(0x1) << ACIFC_IDR_SUTINT0_Pos)
#define ACIFC_IDR_ACINT1_Pos        2            /**< \brief (ACIFC_IDR) AC1 Interrupt Disable */
#define ACIFC_IDR_ACINT1            (_U(0x1) << ACIFC_IDR_ACINT1_Pos)
#define ACIFC_IDR_SUTINT1_Pos       3            /**< \brief (ACIFC_IDR) AC1 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT1           (_U(0x1) << ACIFC_IDR_SUTINT1_Pos)
#define ACIFC_IDR_ACINT2_Pos        4            /**< \brief (ACIFC_IDR) AC2 Interrupt Disable */
#define ACIFC_IDR_ACINT2            (_U(0x1) << ACIFC_IDR_ACINT2_Pos)
#define ACIFC_IDR_SUTINT2_Pos       5            /**< \brief (ACIFC_IDR) AC2 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT2           (_U(0x1) << ACIFC_IDR_SUTINT2_Pos)
#define ACIFC_IDR_ACINT3_Pos        6            /**< \brief (ACIFC_IDR) AC3 Interrupt Disable */
#define ACIFC_IDR_ACINT3            (_U(0x1) << ACIFC_IDR_ACINT3_Pos)
#define ACIFC_IDR_SUTINT3_Pos       7            /**< \brief (ACIFC_IDR) AC3 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT3           (_U(0x1) << ACIFC_IDR_SUTINT3_Pos)
#define ACIFC_IDR_ACINT4_Pos        8            /**< \brief (ACIFC_IDR) AC4 Interrupt Disable */
#define ACIFC_IDR_ACINT4            (_U(0x1) << ACIFC_IDR_ACINT4_Pos)
#define ACIFC_IDR_SUTINT4_Pos       9            /**< \brief (ACIFC_IDR) AC4 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT4           (_U(0x1) << ACIFC_IDR_SUTINT4_Pos)
#define ACIFC_IDR_ACINT5_Pos        10           /**< \brief (ACIFC_IDR) AC5 Interrupt Disable */
#define ACIFC_IDR_ACINT5            (_U(0x1) << ACIFC_IDR_ACINT5_Pos)
#define ACIFC_IDR_SUTINT5_Pos       11           /**< \brief (ACIFC_IDR) AC5 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT5           (_U(0x1) << ACIFC_IDR_SUTINT5_Pos)
#define ACIFC_IDR_ACINT6_Pos        12           /**< \brief (ACIFC_IDR) AC6 Interrupt Disable */
#define ACIFC_IDR_ACINT6            (_U(0x1) << ACIFC_IDR_ACINT6_Pos)
#define ACIFC_IDR_SUTINT6_Pos       13           /**< \brief (ACIFC_IDR) AC6 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT6           (_U(0x1) << ACIFC_IDR_SUTINT6_Pos)
#define ACIFC_IDR_ACINT7_Pos        14           /**< \brief (ACIFC_IDR) AC7 Interrupt Disable */
#define ACIFC_IDR_ACINT7            (_U(0x1) << ACIFC_IDR_ACINT7_Pos)
#define ACIFC_IDR_SUTINT7_Pos       15           /**< \brief (ACIFC_IDR) AC7 Startup Time Interrupt Disable */
#define ACIFC_IDR_SUTINT7           (_U(0x1) << ACIFC_IDR_SUTINT7_Pos)
#define ACIFC_IDR_WFINT0_Pos        24           /**< \brief (ACIFC_IDR) Window0 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT0            (_U(0x1) << ACIFC_IDR_WFINT0_Pos)
#define ACIFC_IDR_WFINT1_Pos        25           /**< \brief (ACIFC_IDR) Window1 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT1            (_U(0x1) << ACIFC_IDR_WFINT1_Pos)
#define ACIFC_IDR_WFINT2_Pos        26           /**< \brief (ACIFC_IDR) Window2 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT2            (_U(0x1) << ACIFC_IDR_WFINT2_Pos)
#define ACIFC_IDR_WFINT3_Pos        27           /**< \brief (ACIFC_IDR) Window3 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT3            (_U(0x1) << ACIFC_IDR_WFINT3_Pos)
#define ACIFC_IDR_MASK              _U(0x0F00FFFF) /**< \brief (ACIFC_IDR) MASK Register */

/* -------- ACIFC_IMR : (ACIFC Offset: 0x18) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACINT0:1;         /*!< bit:      0  AC0 Interrupt Mask                 */
    uint32_t SUTINT0:1;        /*!< bit:      1  AC0 Startup Time Interrupt Mask    */
    uint32_t ACINT1:1;         /*!< bit:      2  AC1 Interrupt Mask                 */
    uint32_t SUTINT1:1;        /*!< bit:      3  AC1 Startup Time Interrupt Mask    */
    uint32_t ACINT2:1;         /*!< bit:      4  AC2 Interrupt Mask                 */
    uint32_t SUTINT2:1;        /*!< bit:      5  AC2 Startup Time Interrupt Mask    */
    uint32_t ACINT3:1;         /*!< bit:      6  AC3 Interrupt Mask                 */
    uint32_t SUTINT3:1;        /*!< bit:      7  AC3 Startup Time Interrupt Mask    */
    uint32_t ACINT4:1;         /*!< bit:      8  AC4 Interrupt Mask                 */
    uint32_t SUTINT4:1;        /*!< bit:      9  AC4 Startup Time Interrupt Mask    */
    uint32_t ACINT5:1;         /*!< bit:     10  AC5 Interrupt Mask                 */
    uint32_t SUTINT5:1;        /*!< bit:     11  AC5 Startup Time Interrupt Mask    */
    uint32_t ACINT6:1;         /*!< bit:     12  AC6 Interrupt Mask                 */
    uint32_t SUTINT6:1;        /*!< bit:     13  AC6 Startup Time Interrupt Mask    */
    uint32_t ACINT7:1;         /*!< bit:     14  AC7 Interrupt Mask                 */
    uint32_t SUTINT7:1;        /*!< bit:     15  AC7 Startup Time Interrupt Mask    */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t WFINT0:1;         /*!< bit:     24  Window0 Mode Interrupt Mask        */
    uint32_t WFINT1:1;         /*!< bit:     25  Window1 Mode Interrupt Mask        */
    uint32_t WFINT2:1;         /*!< bit:     26  Window2 Mode Interrupt Mask        */
    uint32_t WFINT3:1;         /*!< bit:     27  Window3 Mode Interrupt Mask        */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_IMR_OFFSET            0x18         /**< \brief (ACIFC_IMR offset) Interrupt Mask Register */
#define ACIFC_IMR_RESETVALUE        _U(0x00000000); /**< \brief (ACIFC_IMR reset_value) Interrupt Mask Register */

