frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/acifc.h
/* -------- ACIFC_CONF : (ACIFC Offset: 0xD0) (R/W 32) CONF AC Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t IS:2;             /*!< bit:  0.. 1  Interupt Settings                  */
    uint32_t :2;               /*!< bit:  2.. 3  Reserved                           */
    uint32_t MODE:2;           /*!< bit:  4.. 5  Analog Comparator Mode             */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t INSELN:2;         /*!< bit:  8.. 9  Negative Input Select              */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t EVENN:1;          /*!< bit:     16  Peripheral Event Enable Negative   */
    uint32_t EVENP:1;          /*!< bit:     17  Peripheral Event Enable Positive   */
    uint32_t :6;               /*!< bit: 18..23  Reserved                           */
    uint32_t HYS:2;            /*!< bit: 24..25  Hysteresis Voltage Value           */
    uint32_t FAST:1;           /*!< bit:     26  Fast Mode Enable                   */
    uint32_t ALWAYSON:1;       /*!< bit:     27  Always On                          */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_CONF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_CONF_OFFSET           0xD0         /**< \brief (ACIFC_CONF offset) AC Configuration Register */
#define ACIFC_CONF_RESETVALUE       _U(0x00000000); /**< \brief (ACIFC_CONF reset_value) AC Configuration Register */

#define ACIFC_CONF_IS_Pos           0            /**< \brief (ACIFC_CONF) Interupt Settings */
#define ACIFC_CONF_IS_Msk           (_U(0x3) << ACIFC_CONF_IS_Pos)
#define ACIFC_CONF_IS(value)        (ACIFC_CONF_IS_Msk & ((value) << ACIFC_CONF_IS_Pos))
#define ACIFC_CONF_MODE_Pos         4            /**< \brief (ACIFC_CONF) Analog Comparator Mode */
#define ACIFC_CONF_MODE_Msk         (_U(0x3) << ACIFC_CONF_MODE_Pos)
#define ACIFC_CONF_MODE(value)      (ACIFC_CONF_MODE_Msk & ((value) << ACIFC_CONF_MODE_Pos))
#define ACIFC_CONF_INSELN_Pos       8            /**< \brief (ACIFC_CONF) Negative Input Select */
#define ACIFC_CONF_INSELN_Msk       (_U(0x3) << ACIFC_CONF_INSELN_Pos)
#define ACIFC_CONF_INSELN(value)    (ACIFC_CONF_INSELN_Msk & ((value) << ACIFC_CONF_INSELN_Pos))
#define ACIFC_CONF_EVENN_Pos        16           /**< \brief (ACIFC_CONF) Peripheral Event Enable Negative */
#define ACIFC_CONF_EVENN            (_U(0x1) << ACIFC_CONF_EVENN_Pos)
#define ACIFC_CONF_EVENP_Pos        17           /**< \brief (ACIFC_CONF) Peripheral Event Enable Positive */
#define ACIFC_CONF_EVENP            (_U(0x1) << ACIFC_CONF_EVENP_Pos)
#define ACIFC_CONF_HYS_Pos          24           /**< \brief (ACIFC_CONF) Hysteresis Voltage Value */
#define ACIFC_CONF_HYS_Msk          (_U(0x3) << ACIFC_CONF_HYS_Pos)
#define ACIFC_CONF_HYS(value)       (ACIFC_CONF_HYS_Msk & ((value) << ACIFC_CONF_HYS_Pos))
#define ACIFC_CONF_FAST_Pos         26           /**< \brief (ACIFC_CONF) Fast Mode Enable */
#define ACIFC_CONF_FAST             (_U(0x1) << ACIFC_CONF_FAST_Pos)
#define ACIFC_CONF_ALWAYSON_Pos     27           /**< \brief (ACIFC_CONF) Always On */
#define ACIFC_CONF_ALWAYSON         (_U(0x1) << ACIFC_CONF_ALWAYSON_Pos)
#define ACIFC_CONF_MASK             _U(0x0F030333) /**< \brief (ACIFC_CONF) MASK Register */

/** \brief AcifcConf hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO ACIFC_CONF_Type           CONF;        /**< \brief Offset: 0x00 (R/W 32) AC Configuration Register */
 } bf;
 struct {
  RwReg   ACIFC_CONF;         /**< \brief (ACIFC Offset: 0x00) AC Configuration Register */
 } reg;
} AcifcConf;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief AcifcConfw hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO ACIFC_CONFW_Type          CONFW;       /**< \brief Offset: 0x00 (R/W 32) Window configuration Register */
 } bf;
 struct {
  RwReg   ACIFC_CONFW;        /**< \brief (ACIFC Offset: 0x00) Window configuration Register */
 } reg;
} AcifcConfw;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief ACIFC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO ACIFC_CTRL_Type           CTRL;        /**< \brief Offset: 0x00 (R/W 32) Control Register */
  __I  ACIFC_SR_Type             SR;          /**< \brief Offset: 0x04 (R/  32) Status Register */
       RoReg8                    Reserved1[0x8];
  __O  ACIFC_IER_Type            IER;         /**< \brief Offset: 0x10 ( /W 32) Interrupt Enable Register */
  __O  ACIFC_IDR_Type            IDR;         /**< \brief Offset: 0x14 ( /W 32) Interrupt Disable Register */
  __I  ACIFC_IMR_Type            IMR;         /**< \brief Offset: 0x18 (R/  32) Interrupt Mask Register */
  __I  ACIFC_ISR_Type            ISR;         /**< \brief Offset: 0x1C (R/  32) Interrupt Status Register */
  __O  ACIFC_ICR_Type            ICR;         /**< \brief Offset: 0x20 ( /W 32) Interrupt Status Clear Register */
  __IO ACIFC_TR_Type             TR;          /**< \brief Offset: 0x24 (R/W 32) Test Register */
       RoReg8                    Reserved2[0x8];
  __I  ACIFC_PARAMETER_Type      PARAMETER;   /**< \brief Offset: 0x30 (R/  32) Parameter Register */
  __I  ACIFC_VERSION_Type        VERSION;     /**< \brief Offset: 0x34 (R/  32) Version Register */
       RoReg8                    Reserved3[0x48];
       AcifcConfw                Confw[4];    /**< \brief Offset: 0x80 AcifcConfw groups */
       RoReg8                    Reserved4[0x40];
       AcifcConf                 Conf[8];     /**< \brief Offset: 0xD0 AcifcConf groups */
 } bf;
 struct {
  RwReg   ACIFC_CTRL;         /**< \brief (ACIFC Offset: 0x00) Control Register */
  RoReg   ACIFC_SR;           /**< \brief (ACIFC Offset: 0x04) Status Register */
  RoReg8  Reserved5[0x8];
  WoReg   ACIFC_IER;          /**< \brief (ACIFC Offset: 0x10) Interrupt Enable Register */
  WoReg   ACIFC_IDR;          /**< \brief (ACIFC Offset: 0x14) Interrupt Disable Register */
  RoReg   ACIFC_IMR;          /**< \brief (ACIFC Offset: 0x18) Interrupt Mask Register */
  RoReg   ACIFC_ISR;          /**< \brief (ACIFC Offset: 0x1C) Interrupt Status Register */
  WoReg   ACIFC_ICR;          /**< \brief (ACIFC Offset: 0x20) Interrupt Status Clear Register */
  RwReg   ACIFC_TR;           /**< \brief (ACIFC Offset: 0x24) Test Register */
  RoReg8  Reserved6[0x8];
  RoReg   ACIFC_PARAMETER;    /**< \brief (ACIFC Offset: 0x30) Parameter Register */
  RoReg   ACIFC_VERSION;      /**< \brief (ACIFC Offset: 0x34) Version Register */
  RoReg8  Reserved7[0x48];
  AcifcConfw ACIFC_CONFW[4];     /**< \brief (ACIFC Offset: 0x80) AcifcConfw groups */
  RoReg8  Reserved8[0x40];
  AcifcConf ACIFC_CONF[8];      /**< \brief (ACIFC Offset: 0xD0) AcifcConf groups */
 } reg;
} Acifc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_ACIFC_COMPONENT_ */
